app/controllers/books_controller.rb

INSERT INTO "books" ("title", "image", "isbn", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "dcdsc"], ["image", "index.jpeg"], ["isbn", 0], ["created_at", "2015-06-20 21:29:27.903684"], ["updated_at", "2015-06-20 21:29:27.903684"]]
---
  def create
    p = book_params
    p[:user_id] = current_user.id
    @book = Book.new(p)

    respond_to do |format|
      if @book.save